<template>
  <div class="page page--static">
    <div class="container">
      <Breadcrumbs/>
      <div class="row">
        <div class="col-12 col-md-9">
          <h1 class="page__title">
            Гарантия и условия возврата товара
          </h1>
          <h2 class="page__h2">Образец заявления на возврат</h2>
          <div class="page__text page__text--block">
            <o-button>Скачать образец</o-button>
          </div>
          <div class="page__text page__text--block">Компания «О-ДИЗАЙН» предоставляет гарантию на товары из каталога в соответствии с действующим законодательством РФ. Условия возврата продукции, а также гарантийные обязательства определяются постановлением Правительства РФ о правилах дистанционной продажи товаров, Законом «О защите прав потребителей» и другими нормативными правовыми актами.</div>


          <h2 class="page__h2">Возврат продукции надлежащего качества</h2>
          <div class="page__text page__text--block">
            <p>Товары надлежащего качества, приобретенные в интернет-магазине Odesign.ru, можно вернуть в любое время до его передачи Покупателю или в течение 14 дней после получения товара. Условия возврата продукции:</p>

            <ul>
              <li>Товар не был в употреблении, и его потребительские свойства, как и внешний вид, полностью сохранены. В случае обнаружения следов эксплуатации или механических повреждений, Продавец письменно уведомляет Покупателя о невозможности возврата денежных средств за приобретенные товары;</li>
              <li>Покупатель может предоставить документы, необходимые для подтверждения покупки товара в интернет-магазине Odesign.ru</li>
            </ul>

            <p>Продукция надлежащего качества, бывшая в употреблении, потерявшая товарный вид или имеющая нарушенную заводскую упаковку, уцененная в связи с наличием недостатков, оговоренных Продавцом в описании товара на Сайте, в том числе в связи со снятием товаров с производства, а также товары с индивидуально определенными свойствами, изготовленные на заказ, к возврату не принимаются.</p>

            <p>Возврат Товара надлежащего качества осуществляется Покупателем самостоятельно. Доставка Товара до Продавца при возврате Товара надлежащего качества производится за счет Покупателя.</p>

            <p>При доставке Заказа по Москве и Московской области, возврат Товара производится в магазин Продавца по адресу: 101000, Москва, Банковский пер., д.2/5.</p>

            <p>При доставке Заказа по России за пределы Московской области, возврат Товара, по согласованию с Продавцом, производится почтовым отправлением по адресу: 101000, г. Москва, а/я 377 или транспортной компанией по адресу: 101000, Москва, Банковский пер., д.2/5.</p>

            <p>Возврат денежных средств Покупателю при возврате Товара надлежащего качества производится в течение 10 (десяти) дней с даты получения Продавцом соответствующего письменного требования (заявления) от Покупателя и проверки Продавцом возвращенного Товара.</p>

            <p>Денежная сумма, уплаченная Покупателем в соответствии с договором, возвращается Покупателю, за исключением расходов на доставку возвращенного Товара до Продавца. Денежные средства возвращаются Покупателю тем же способом, каким была произведена оплата.</p>
          </div>
          <h2 class="page__h2">Возврат продукции надлежащего качества</h2>
          <div class="page__text page__text--block">
            <p>При получении Товара до вскрытия его упаковки Покупателю необходимо произвести визуальный осмотр продукции на предмет выявления брака. Если механические повреждения или прочие дефекты были обнаружены после вскрытия его упаковки при наклеивании одного из рулонов, нужно прекратить оклейку и связаться с Продавцом, поскольку дальнейшая работа является зоной ответственности мастера.</p>

            <p>Возврат Товара ненадлежащего качества осуществляется Покупателем самостоятельно.</p>

            <p>При доставке Заказа по Москве и Московской области, возврат Товара производится в магазин Продавца по адресу: 101000, Москва, Банковский пер., д.2/5.</p>

            <p>При доставке Заказа по России за пределы Московской области, возврат Товара, по согласованию с Продавцом, производится почтовым отправлением по адресу: 101000, г. Москва, а/я 377.</p>

            <p>Доставка Товара до Продавца при возврате Товара ненадлежащего качества производится за счет Продавца. Возврат денежных средств производится Продавцом в течение 10 (десяти) дней с даты получения Продавцом письменного требования (заявления) Покупателя и проверки Продавцом возвращенного Товара. Денежные средства возвращаются Покупателю тем же способом, каким была произведена оплата.</p>

            <p>Претензии на некачественный товар рассматриваются только при наличии рулонов обоев ненадлежащего качества, этикетки от наклеенного рулона обоев, к которому предъявляется претензия и документов, подтверждающих покупку товара в интернет-магазине Odesign.ru.</p>

            <h4 class="page__h4">Обратите внимание!</h4>

            <p>В случае обнаружения брака компания «О-ДИЗАЙН» осуществляет возврат денежных средств только за приобретенные обои. Затраты на расходные материалы и услуги мастера не возмещаются.</p>

            <p>Вся информация о Товаре, представленная на Сайте, имеет справочный характер и не может в полной мере передавать достоверную информацию о свойствах и характеристиках Товара, включая цвета, размеры и формы. В случае возникновения у Покупателя вопросов, касающихся свойств и характеристик Товара, перед оформлением Заказа, Покупатель должен обратиться к Продавцу. Отличие элементов дизайна или оформления от заявленных в описании на сайте не является браком.</p>

            <p>При получении Заказа, Покупатель должен проверить внешний вид и целостность упаковки Товара, а также комплектность Заказа по количеству и ассортименту Товара. После получения Заказа и проставления Покупателем или указанным им получателем Заказа подписи в документах, подтверждающих доставку Заказа, претензии по количеству, внешнему виду, комплектности и упаковке Товара не принимаются.</p>

            <p>Претензии к качеству товаров принимаются каждый рабочий день, с 10.00 до 19.00 часов, по адресу 101000 г. Москва, Москва, Банковский пер., д.2/5., по тел. 8 495 623-44-45 или по электронной почте shop@odesign.ru</p>

            <p>Полные условия возврата товара указаны в <a href="#">«Условиях продажи товаров в интернет-магазине «Odesign.ru»</a></p>
          </div>
        </div>
        <div class="col-12 col-md-3">
          <CollectionSimpleWidget title="Коллекции" :limit="2"/>
          <ProductSimpleWidget title="Новинки" type="full" :limit="2"/>
        </div>
        </div>
    </div>
  </div>
</template>

<script>
import Slider from '@/components/Slider'
import ProductWidget from '@/components/product/product-widget/ProductWidget'
import ProductTopWidget from '@/components/product/product-top-widget/ProductTopWidget'
import ProductSliderWidget from '@/components/product/product-slider-widget/ProductSliderWidget'
import NewsWidget from '@/components/news/news-widget/NewsWidget'
import Breadcrumbs from '@/components/common/Breadcrumbs'
import ProductSimpleWidget from '@/components/product/product-simple-widget/ProductSimpleWidget'
import CollectionSimpleWidget from '@/components/product/collection-simple-widget/CollectionSimpleWidget'

export default {
  components: {
    Breadcrumbs,
    Slider,
    ProductTopWidget,
    ProductWidget,
    NewsWidget,
    ProductSliderWidget,
    ProductSimpleWidget,
    CollectionSimpleWidget
  },
  async asyncData({ store }) {
    const breadcrumbs = [
      { title: 'Гарантия и условия возврата товара' },
    ]

    await store.dispatch('ui/setBreadcrumbs', { breadcrumbs })
    return { }
  }
}
</script>

<style lang="scss">

@media (max-width: 768px) {

}
</style>
