<template>
  <div class="page page--static">
    <div class="container">
      <Breadcrumbs/>
      <div class="row">
        <div class="col-12 col-md-9">
          <h1 class="page__title">
            Отзывы наших клиентов
          </h1>
          <o-button>Оставить отзыв</o-button>
          <div class="review-wrap">
            <review v-for="(item, index) in reviews" :item="item" :key="index"/>
            <Pagination :pages="2" :current-page="0"/>
          </div>
        </div>
        <div class="col-12 col-md-3">
          <CollectionSimpleWidget title="Коллекции" :limit="2"/>
          <ProductSimpleWidget title="Новинки" type="full" :limit="2"/>
        </div>
        </div>
    </div>
  </div>
</template>

<script>
import Review from '@/components/review/Review'
import ProductWidget from '@/components/product/product-widget/ProductWidget'
import Pagination from '@/components/common/Pagination'
import ProductSliderWidget from '@/components/product/product-slider-widget/ProductSliderWidget'
import NewsWidget from '@/components/news/news-widget/NewsWidget'
import Breadcrumbs from '@/components/common/Breadcrumbs'
import ProductSimpleWidget from '@/components/product/product-simple-widget/ProductSimpleWidget'
import CollectionSimpleWidget from '@/components/product/collection-simple-widget/CollectionSimpleWidget'

export default {
  components: {
    Breadcrumbs,
    Review,
    Pagination,
    ProductWidget,
    NewsWidget,
    ProductSliderWidget,
    ProductSimpleWidget,
    CollectionSimpleWidget
  },
  async asyncData({ store }) {
    const breadcrumbs = [
      { title: 'Отзывы' },
    ]

    const reviews = [
      {name: 'Эниса', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Марина Архарова', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Терехов Антон', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Эниса', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Марина Архарова', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Терехов Антон', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Эниса', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
      {name: 'Марина Архарова', date: '6 ноября 2019', text: 'С удовольствием посещаю магазин «О-Дизайн», потому что здесь прекрасный выбор обоев, знающие консультанты и очень приятная атмосфера творчества. Хотела бы отметить работу Виталия, который почувствовал настроение будущего проекта и помог выбрать лаконичные, но очень выразительные обои. И девушка на кассе (не знаю имени) максимально внимательно относится к клиентам. Отличный магазин!' },
    ]

    await store.dispatch('ui/setBreadcrumbs', { breadcrumbs })
    return { reviews }
  }
}
</script>

<style lang="scss">
.review-wrap{
  margin-top: 20px;
}
@media (max-width: 768px) {

}
</style>
